START MVI H,LIGHT
MVI L, LOC ;можеше и LXI H, LIGHT LOC
MOV A,M ; се вчитува првата локација од ROM
OUT PORTA ; се праќа на соодветна I/O порта
CALL DOCNI_1MIN ;се повикува процедура за доцнење од 1 минута
INX H ; зголеми го HL парот за 1 (наредна локација)
MOV A,M ; се вчитува втората локација од ROM
OUT PORTA ; се праќа на соодветна I/O порта
CALL DOCNI_3SEC ;се повикува процедура за доцнење од 3 секунди
MOV A,M ; се вчитува првата локација од ROM
OUT PORTA ; се праќа на соодветна I/O порта
CALL DOCNI_3SEC ;се повикува процедура за доцнење од 3 секунди
JMP START ;на почеток на првобитната состојба на семафорот
END 
